$(function () {
    echart_map();

    function echart_0() {
        //基于准备好的dom，初始化echarts实例
        //按钮5
    
        var dom = document.getElementById('chart_0');
    var myChart = echarts.init(dom, null, {
      renderer: 'canvas',
      useDirtyRect: false
    });
    var app = {};
    
    var option;

    option = {
  tooltip: {
    trigger: 'axis',
    axisPointer: {
      type: 'shadow'
    }
  },
  legend: {
    icon:'circle',
    top:50,
    textStyle:{
        fontSize: 20,//字体大小
        color: '#ffffff'//字体颜色
    },  
  },
  grid: {
    left: '3%',
    right: '4%',
    bottom: '1%',
    containLabel: true,
    height:650,
  },
  xAxis: [
    {
      type: 'category',
      data: ['2018', '2020', '2022', '2024', '2026', '2028', '2030', '2032', '2034', '2036', '2038', '2040', '2042', '2044', '2046', '2048', '2050', '2052', '2054', '2056', '2058', '2060'],
      axisLine: {
        lineStyle:{
            color:'#ffffff',
        }
    }
  }
  ],
  yAxis: [
    {
      type: 'value',
      axisLine: {
        lineStyle:{
            color:'#ffffff',
        }
      },  
    }
  ],
  //数据
  series: [
    {
      name: '其他非二氧化碳温室气体排放',
      type: 'bar',
      emphasis: {
        focus: 'series'
      },
      data: [120,122,124,126,128,130,130,129,127,123,121.5,119.2,116.9,114.6,112.3,110,107.7,105.4,105,104,102,95,93,91,89,87,85,83,81,80,78,75,72,70,67,64.3,61.6,58.9,56.2,53.5,50.8,48.1,48]
    },
    {
      name: '工业过程等其他二氧化碳排放',
      type: 'bar',
      stack: 'Ad',
      emphasis: {
        focus: 'series'
      },
      data: [100,102,104,106,108,110,110,109,107,103,101.5,99.2,96.9,94.6,92.3,90,87.7,85.4,85,84,82,75,73,71,69,67,65,63,61,60,58,55,52,50,47,44.3,41.6,38.9,36.2,33.5,30.8,28.1,28]
    },
    {
      name: '能源二氧化碳排放',
      type: 'bar',
      stack: 'Ad',
      emphasis: {
        focus: 'series'
      },
      data: [90,92,94,96,98,100,100,99,97,93,91.5,89.2,86.9,84.6,82.3,80,77.7,75.4,75,74,72,70,68,66,64,62,60,58,56,55,55,52,49,47,44,41.3,38.6,35.9,33.2,30.5,27.8,25.1,25]
    },
    {
      name: '负排放',
      type: 'bar',
      stack: 'Ad',
      emphasis: {
        focus: 'series'
      },
      data: [-5,-5,-5,-5,-5,-5,-5,-5,-6,-6,-7,-8,-9,-10,-11,-12,-13,-14,-15,-16,-17,-18,-19,-20,-21,-22,-23,-24,-25,-26,-27,-28,-29,-30,-31,-32,-33,-34,-35,-36,-37,-38,-39]
    },
    // {
    //   name: '',
    //   type: 'bar',
    //   data: [862, 1018, 964, 1026, 1679, 1600, 1570],
    //   emphasis: {
    //     focus: 'series'
    //   },
    //   markLine: {
    //     lineStyle: {
    //       type: 'dashed'
    //     },
    //     data: [[{ type: 'min' }, { type: 'max' }]]
    //   }
    // },
    {
      name: '净排放',
      type: 'bar',
      barWidth: 5,
      stack: 'Search Engine',
      emphasis: {
        focus: 'series'
      },
      data: [114,116,118,120,122,124,124,123,121,117,115.5,113.2,108.9,106.6,102.3,98,96.7,93.4,92,90,90,87,83,78,75,70.5,66.4,62.3,58.2,54.1,50,45.9,41.8,37.7,33.6,29.5,25.4,21.3,17.2,13.1,9,4.9,0]
    },
  ]
};

    if (option && typeof option === 'object') {
      myChart.setOption(option);
    }

    window.addEventListener('resize', myChart.resize);
    }

    function echart_map() {
      // 基于准备好的dom，初始化echarts实例
      // 按钮1
      var dom = document.getElementById('chart_map');
    var myChart = echarts.init(dom, null, {
      renderer: 'canvas',
      useDirtyRect: false
    });
    var app = {};
    
    var option;

    const data = [
  { name: '合肥', value: 39.47 },
  { name: '芜湖', value: 19.74 },
  { name: '蚌埠', value: 16.05 },
  { name: '淮南', value: 17.10 },
  { name: '马鞍山', value: 14.33 },
  { name: '淮北', value: 13.93 },
  { name: '铜陵', value: 6.50 },
  { name: '安庆', value: 18.50 },
  { name: '黄山', value: 7.96 },
  { name: '滁州', value: 29.86 },
  { name: '阜阳', value: 29.97 },
  { name: '宿州', value: 23.31 },
  { name: '巢湖', value: 24.67 },
  { name: '六安', value: 20.04 },
  { name: '亳州', value: 18.51 },
  { name: '宣城', value: 15.16 },
  { name: '北京', value: 60.09 },
  { name: '福州', value: 43.16 },
  { name: '厦门', value: 22.33 },
  { name: '莆田', value: 17.97 },
  { name: '三明', value: 12.90 },
  { name: '泉州', value: 56.63 },
  { name: '漳州', value: 36.12 },
  { name: '南平', value: 11.57 },
  { name: '龙岩', value: 16.44 },
  { name: '宁德', value: 12.87 },
  { name: '兰州', value: 39.52 },
  { name: '嘉峪关', value: 5.73 },
  { name: '金昌', value: 6.00 },
  { name: '白银', value: 12.91 },
  { name: '天水', value: 13.09 },
  { name: '武威', value: 7.19 },
  { name: '张掖', value: 8.53 },
  { name: '平凉', value: 10.39 },
  { name: '酒泉', value: 15.27 },
  { name: '庆阳', value: 19.91 },
  { name: '定西', value: 13.05 },
  { name: '陇南', value: 8.97 },
  { name: '临夏回族自治州', value: 7.65 },
  { name: '甘南藏族自治州', value: 3.18 },
  { name: '广州', value: 67.65 },
  { name: '韶关', value: 14.00 },
  { name: '深圳', value: 35.05 },
  { name: '珠海', value: 16.13 },
  { name: '汕头', value: 22.72 },
  { name: '佛山', value: 47.61 },
  { name: '江门', value: 32.27 },
  { name: '湛江', value: 20.82 },
  { name: '茂名', value: 16.37 },
  { name: '肇庆', value: 18.74 },
  { name: '惠州', value: 39.43 },
  { name: '梅州', value: 16.18 },
  { name: '汕尾', value: 11.56 },
  { name: '河源', value: 11.40 },
  { name: '阳江', value: 12.01 },
  { name: '清远', value: 21.72 },
  { name: '东莞', value: 44.03 },
  { name: '中山', value: 25.42 },
  { name: '潮州', value: 11.63 },
  { name: '揭阳', value: 20.48 },
  { name: '云浮', value: 9.44 },
  { name: '南宁', value: 43.55 },
  { name: '柳州', value: 25.65 },
  { name: '桂林', value: 21.71 },
  { name: '梧州', value: 11.55 },
  { name: '北海', value: 16.18 },
  { name: '防城港', value: 6.36 },
  { name: '钦州', value: 12.96 },
  { name: '贵港', value: 15.50 },
  { name: '玉林', value: 19.50 },
  { name: '百色', value: 15.45 },
  { name: '贺州', value: 6.55 },
  { name: '河池', value: 9.86 },
  { name: '来宾', value: 15.18 },
  { name: '崇左', value: 11.82 },
  { name: '贵阳', value: 57.52 },
  { name: '六盘水', value: 35.41 },
  { name: '遵义', value: 36.09 },
  { name: '安顺', value: 18.67 },
  { name: '铜仁地区', value: 15.73 },
  { name: '黔西南布依族苗族自治州', value: 25.60 },
  { name: '毕节地区', value: 20.46 },
  { name: '黔东南苗族侗族自治州', value: 20.47 },
  { name: '黔南布依族苗族自治州', value: 23.62 },
  { name: '海口', value: 12.93 },
  { name: '三亚', value: 6.48 },
  { name: '五指山', value: 0.62 },
  { name: '琼海', value: 3.17 },
  { name: '儋州', value: 3.78 },
  { name: '文昌', value: 3.04 },
  { name: '万宁', value: 3.52 },
  { name: '东方', value: 1.63 },
  { name: '安定', value: 0.97 },
  { name: '屯昌', value: 0.84 },
  { name: '澄迈', value: 2.96 },
  { name: '临高', value: 1.35 },
  { name: '白沙黎族自治县', value: 0.95 },
  { name: '昌江黎族自治县', value: 2.26 },
  { name: '乐东黎族自治县', value: 1.72 },
  { name: '陵水黎族自治县', value: 3.27 },
  { name: '石家庄', value: 94.95 },
  { name: '唐山', value: 102.06 },
  { name: '秦皇岛', value: 31.53 },
  { name: '邯郸', value: 77.30 },
  { name: '邢台', value: 54.82 },
  { name: '保定', value: 85.81 },
  { name: '张家口', value: 35.73 },
  { name: '承德', value: 22.69 },
  { name: '沧州', value: 79.75 },
  { name: '廊坊', value: 64.08 },
  { name: '衡水', value: 33.73 },
  { name: '郑州', value: 74.36 },
  { name: '开封', value: 24.82 },
  { name: '洛阳', value: 41.48 },
  { name: '平顶山', value: 34.77 },
  { name: '安阳', value: 37.90 },
  { name: '鹤壁', value: 12.03 },
  { name: '新乡', value: 42.55 },
  { name: '焦作', value: 26.61 },
  { name: '濮阳', value: 25.29 },
  { name: '许昌', value: 26.99 },
  { name: '漯河', value: 14.81 },
  { name: '三门峡', value: 17.05 },
  { name: '南阳', value: 45.27 },
  { name: '商丘', value: 34.73 },
  { name: '信阳', value: 19.80 },
  { name: '周口', value: 35.52 },
  { name: '驻马店', value: 29.92 },
  { name: '济源', value: 7.40 },
  { name: '哈尔滨', value: 48.30 },
  { name: '齐齐哈尔', value: 22.42 },
  { name: '鸡西', value: 12.27 },
  { name: '鹤岗', value: 11.16 },
  { name: '双鸭山', value: 17.08 },
  { name: '大庆', value: 30.38 },
  { name: '伊春', value: 8.15 },
  { name: '佳木斯', value: 17.62 },
  { name: '七台河', value: 6.32 },
  { name: '牡丹江', value: 14.90 },
  { name: '黑河', value: 10.92 },
  { name: '绥化', value: 22.43 },
  { name: '大兴安岭地区', value: 3.44 },
  { name: '武汉', value: 89.07 },
  { name: '黄石', value: 16.05 },
  { name: '十堰', value: 16.82 },
  { name: '宜昌', value: 29.38 },
  { name: '襄阳', value: 31.37 },
  { name: '鄂州', value: 10.72 },
  { name: '荆门', value: 14.26 },
  { name: '孝感', value: 23.14 },
  { name: '荆州', value: 23.15 },
  { name: '黄冈', value: 28.29 },
  { name: '咸宁', value: 12.92 },
  { name: '随州', value: 9.74 },
  { name: '恩施土家族苗族自治州', value: 7.61 },
  { name: '仙桃', value: 5.02 },
  { name: '潜江', value: 6.40 },
  { name: '天门', value: 4.62 },
  { name: '神农架林区', value: 0.46 },
  { name: '长沙', value: 69.20 },
  { name: '株洲', value: 23.51 },
  { name: '湘潭', value: 20.85 },
  { name: '衡阳', value: 26.26 },
  { name: '邵阳', value: 16.57 },
  { name: '岳阳', value: 27.74 },
  { name: '常德', value: 23.22 },
  { name: '张家界', value: 4.91 },
  { name: '益阳', value: 10.71 },
  { name: '郴州', value: 32.44 },
  { name: '永州', value: 18.96 },
  { name: '怀化', value: 13.28 },
  { name: '娄底', value: 17.67 },
  { name: '湘西土家族苗族自治州', value: 6.19 },
  { name: '长春', value: 68.05 },
  { name: '吉林', value: 37.74 },
  { name: '四平', value: 27.58 },
  { name: '辽源', value: 10.13 },
  { name: '通化', value: 19.77 },
  { name: '白山', value: 12.85 },
  { name: '松原', value: 17.67 },
  { name: '白城', value: 11.97 },
  { name: '延边朝鲜族自治州', value: 21.93 },
  { name: '南京', value: 70.17 },
  { name: '无锡', value: 62.48 },
  { name: '徐州', value: 54.68 },
  { name: '常州', value: 43.31 },
  { name: '苏州', value: 126.81 },
  { name: '南通', value: 60.63 },
  { name: '连云港', value: 33.98 },
  { name: '淮安', value: 33.34 },
  { name: '盐城', value:  54.01},
  { name: '扬州', value: 41.95 },
  { name: '镇江', value: 34.00 },
  { name: '泰州', value: 40.00 },
  { name: '宿迁', value: 30.07 },
  { name: '南昌', value: 38.22 },
  { name: '景德镇', value: 8.85 },
  { name: '萍乡', value: 7.41 },
  { name: '九江', value: 26.83 },
  { name: '新余', value: 8.32 },
  { name: '鹰潭', value: 7.64 },
  { name: '赣州', value: 36.37 },
  { name: '吉安', value: 15.06 },
  { name: '宜春', value: 23.94 },
  { name: '抚州', value: 13.51 },
  { name: '上饶', value: 26.33 },
  { name: '沈阳', value: 81.73 },
  { name: '大连', value: 59.67 },
  { name: '鞍山', value: 34.02 },
  { name: '抚顺', value: 22.86 },
  { name: '本溪', value: 17.80 },
  { name: '丹东', value: 16.66 },
  { name: '锦州', value: 25.43 },
  { name: '营口', value: 26.18 },
  { name: '阜新', value: 18.58 },
  { name: '辽阳', value: 24.83 },
  { name: '盘锦', value: 26.74 },
  { name: '铁岭', value: 31.59 },
  { name: '朝阳', value: 23.56 },
  { name: '葫芦岛', value: 23.82 },
  { name: '呼和浩特', value: 71.35 },
  { name: '包头', value: 56.90 },
  { name: '乌海', value: 26.55 },
  { name: '赤峰', value: 55.74 },
  { name: '通辽', value: 39.34 },
  { name: '鄂尔多斯', value: 104.54 },
  { name: '呼伦贝尔', value: 80.67 },
  { name: '巴彦淖尔', value: 27.84 },
  { name: '乌兰察布', value: 37.74 },
  { name: '兴安盟', value: 19.38 },
  { name: '锡林郭勒盟', value: 38.06 },
  { name: '阿拉善盟', value: 15.38 },
  { name: '银川', value: 65.42 },
  { name: '石嘴山', value: 25.27 },
  { name: '吴忠', value: 35.77 },
  { name: '固原', value: 17.85 },
  { name: '中卫', value: 24.28 },
  { name: '西宁', value: 16.90 },
  { name: '海东地区', value: 10.95 },
  { name: '海北藏族自治州', value: 3.05 },
  { name: '黄南藏族自治州', value: 1.93 },
  { name: '海南藏族自治州', value: 4.65 },
  { name: '果洛藏族自治州', value: 1.08 },
  { name: '玉树藏族自治州', value: 1.56 },
  { name: '海西蒙古族藏族自治州', value: 18.00 },
  { name: '济南', value: 61.57 },
  { name: '青岛', value: 71.72 },
  { name: '淄博', value: 41.43 },
  { name: '枣庄', value: 25.78 },
  { name: '东营', value: 41.95 },
  { name: '烟台', value: 63.72 },
  { name: '潍坊', value: 78.33 },
  { name: '济宁', value: 54.41 },
  { name: '泰安', value: 34.78 },
  { name: '威海', value: 34.81 },
  { name: '日照', value: 20.44 },
  { name: '莱芜', value: 6.11 },
  { name: '临沂', value: 65.22 },
  { name: '德州', value: 43.71 },
  { name: '聊城', value: 38.09 },
  { name: '滨州', value: 43.53 },
  { name: '菏泽', value: 40.96 },
  { name: '太原', value: 38.89 },
  { name: '大同', value: 41.36 },
  { name: '阳泉', value: 17.43 },
  { name: '长治', value: 32.82 },
  { name: '晋城', value: 29.53 },
  { name: '朔州', value: 22.37 },
  { name: '晋中', value: 38.45 },
  { name: '运城', value: 35.98 },
  { name: '忻州', value: 33.18 },
  { name: '临汾', value: 58.52 },
  { name: '吕梁', value: 49.04 },
  { name: '西安', value: 45.60 },
  { name: '铜川', value: 6.70 },
  { name: '宝鸡', value: 19.48 },
  { name: '咸阳', value: 30.66 },
  { name: '渭南', value: 34.95 },
  { name: '延安', value: 54.45 },
  { name: '汉中', value: 12.24 },
  { name: '榆林', value: 57.63 },
  { name: '安康', value: 6.51 },
  { name: '商洛', value: 7.22 },
  { name: '上海', value: 192.50 },
  { name: '成都', value: 88.45 },
  { name: '自贡', value: 5.72 },
  { name: '攀枝花', value: 24.20 },
  { name: '泸州', value: 8.67 },
  { name: '德阳', value: 22.34 },
  { name: '绵阳', value: 24.51 },
  { name: '广元', value: 12.03 },
  { name: '遂宁', value: 11.11 },
  { name: '内江', value: 9.71 },
  { name: '乐山', value: 12.06 },
  { name: '南充', value: 16.24 },
  { name: '眉山', value: 11.05 },
  { name: '宜宾', value: 9.67 },
  { name: '广安', value: 9.62 },
  { name: '达州', value: 13.13 },
  { name: '雅安', value: 5.31 },
  { name: '巴中', value: 4.60 },
  { name: '资阳', value: 9.56 },
  { name: '阿坝藏族羌族自治州', value: 6.51 },
  { name: '甘孜藏族自治州', value: 6.41 },
  { name: '凉山彝族自治州', value: 20.16 },
  { name: '天津', value: 150.05 },
  { name: '乌鲁木齐', value: 26.33 },
  { name: '克拉玛依', value: 23.66 },
  { name: '吐鲁番地区', value: 18.86 },
  { name: '哈密地区', value: 10.49 },
  { name: '昌吉回族自治州', value: 39.05 },
  { name: '博尔塔拉蒙古自治州', value: 9.04 },
  { name: '巴音郭勒蒙古自治州', value: 44.62 },
  { name: '阿克苏地区', value: 47.39 },
  { name: '克孜勒苏柯尔克孜自治州', value: 2.84 },
  { name: '喀什地区', value: 27.46 },
  { name: '和田地区', value: 13.90 },
  { name: '伊犁哈萨克自治州', value: 27.98 },
  { name: '塔城地区', value: 22.14 },
  { name: '阿勒泰地区', value: 12.20 },
  { name: '石河子', value: 6.03 },
  { name: '阿拉尔', value: 2.19 },
  { name: '图木舒克', value: 2.57 },
  { name: '五家渠', value: 3.93 },
  { name: '昆明', value: 47.54 },
  { name: '曲靖', value: 26.61 },
  { name: '玉溪', value: 17.39 },
  { name: '保山', value: 12.49 },
  { name: '昭通', value: 5.90 },
  { name: '丽江', value: 8.28 },
  { name: '普洱', value: 6.50 },
  { name: '临沧', value: 7.24 },
  { name: '楚雄彝族自治州', value: 10.80 },
  { name: '红河哈尼族彝族自治州', value: 20.99 },
  { name: '文山壮族苗族自治州', value: 6.86 },
  { name: '西双版纳傣族自治州', value: 5.85 },
  { name: '大理白族自治州', value: 21.73 },
  { name: '德宏傣族景颇族自治州', value: 10.37 },
  { name: '怒江傈僳族自治州', value: 1.16 },
  { name: '迪庆藏族自治州', value: 2.21 },
  { name: '杭州', value: 62.38 },
  { name: '宁波', value: 63.20 },
  { name: '温州', value: 38.96 },
  { name: '嘉兴', value: 38.13 },
  { name: '湖州', value: 26.66 },
  { name: '绍兴', value: 34.47 },
  { name: '金华', value: 39.09 },
  { name: '衢州', value: 12.29 },
  { name: '舟山', value: 5.94 },
  { name: '台州', value: 37.09 },
  { name: '丽水', value: 11.43 },
  { name: '重庆', value: 153.75 }
];
const geoCoordMap = {
  鄂尔多斯: [109.781327, 39.608266],
  舟山: [122.207216, 29.985295],
  齐齐哈尔: [123.97, 47.33],
  盐城: [120.13, 33.38],
  赤峰: [118.87, 42.28],
  青岛: [120.33, 36.07],
  乳山: [121.52, 36.89],
  金昌: [102.188043, 38.520089],
  泉州: [118.58, 24.93],
  莱西: [120.53, 36.86],
  日照: [119.46, 35.42],
  胶南: [119.97, 35.88],
  南通: [121.05, 32.08],
  拉萨: [91.11, 29.97],
  云浮: [112.02, 22.93],
  梅州: [116.1, 24.55],
  文登: [122.05, 37.2],
  上海: [121.48, 31.22],
  攀枝花: [101.718637, 26.582347],
  威海: [122.1, 37.5],
  承德: [117.93, 40.97],
  厦门: [118.1, 24.46],
  汕尾: [115.375279, 22.786211],
  潮州: [116.63, 23.68],
  丹东: [124.37, 40.13],
  太仓: [121.1, 31.45],
  曲靖: [103.79, 25.51],
  烟台: [121.39, 37.52],
  福州: [119.3, 26.08],
  瓦房店: [121.979603, 39.627114],
  即墨: [120.45, 36.38],
  抚顺: [123.97, 41.97],
  玉溪: [102.52, 24.35],
  张家口: [114.87, 40.82],
  阳泉: [113.57, 37.85],
  莱州: [119.942327, 37.177017],
  湖州: [120.1, 30.86],
  汕头: [116.69, 23.39],
  昆山: [120.95, 31.39],
  宁波: [121.56, 29.86],
  湛江: [110.359377, 21.270708],
  揭阳: [116.35, 23.55],
  荣成: [122.41, 37.16],
  连云港: [119.16, 34.59],
  葫芦岛: [120.836932, 40.711052],
  常熟: [120.74, 31.64],
  东莞: [113.75, 23.04],
  河源: [114.68, 23.73],
  淮安: [119.15, 33.5],
  泰州: [119.9, 32.49],
  南宁: [108.33, 22.84],
  营口: [122.18, 40.65],
  惠州: [114.4, 23.09],
  江阴: [120.26, 31.91],
  蓬莱: [120.75, 37.8],
  韶关: [113.62, 24.84],
  嘉峪关: [98.289152, 39.77313],
  广州: [113.23, 23.16],
  延安: [109.47, 36.6],
  太原: [112.53, 37.87],
  清远: [113.01, 23.7],
  中山: [113.38, 22.52],
  昆明: [102.73, 25.04],
  寿光: [118.73, 36.86],
  盘锦: [122.070714, 41.119997],
  长治: [113.08, 36.18],
  深圳: [114.07, 22.62],
  珠海: [113.52, 22.3],
  宿迁: [118.3, 33.96],
  咸阳: [108.72, 34.36],
  铜川: [109.11, 35.09],
  平度: [119.97, 36.77],
  佛山: [113.11, 23.05],
  海口: [110.35, 20.02],
  江门: [113.06, 22.61],
  章丘: [117.53, 36.72],
  肇庆: [112.44, 23.05],
  大连: [121.62, 38.92],
  临汾: [111.5, 36.08],
  吴江: [120.63, 31.16],
  石嘴山: [106.39, 39.04],
  沈阳: [123.38, 41.8],
  苏州: [120.62, 31.32],
  茂名: [110.88, 21.68],
  嘉兴: [120.76, 30.77],
  长春: [125.35, 43.88],
  胶州: [120.03336, 36.264622],
  银川: [106.27, 38.47],
  张家港: [120.555821, 31.875428],
  三门峡: [111.19, 34.76],
  锦州: [121.15, 41.13],
  南昌: [115.89, 28.68],
  柳州: [109.4, 24.33],
  三亚: [109.511909, 18.252847],
  自贡: [104.778442, 29.33903],
  吉林: [126.57, 43.87],
  阳江: [111.95, 21.85],
  泸州: [105.39, 28.91],
  西宁: [101.74, 36.56],
  宜宾: [104.56, 29.77],
  呼和浩特: [111.65, 40.82],
  成都: [104.06, 30.67],
  大同: [113.3, 40.12],
  镇江: [119.44, 32.2],
  桂林: [110.28, 25.29],
  张家界: [110.479191, 29.117096],
  宜兴: [119.82, 31.36],
  北海: [109.12, 21.49],
  西安: [108.95, 34.27],
  金坛: [119.56, 31.74],
  东营: [118.49, 37.46],
  牡丹江: [129.58, 44.6],
  遵义: [106.9, 27.7],
  绍兴: [120.58, 30.01],
  扬州: [119.42, 32.39],
  常州: [119.95, 31.79],
  潍坊: [119.1, 36.62],
  重庆: [106.54, 29.59],
  台州: [121.420757, 28.656386],
  南京: [118.78, 32.04],
  滨州: [118.03, 37.36],
  贵阳: [106.71, 26.57],
  无锡: [120.29, 31.59],
  本溪: [123.73, 41.3],
  克拉玛依: [84.77, 45.59],
  渭南: [109.5, 34.52],
  马鞍山: [118.48, 31.56],
  宝鸡: [107.15, 34.38],
  焦作: [113.21, 35.24],
  句容: [119.16, 31.95],
  北京: [116.46, 39.92],
  徐州: [117.2, 34.26],
  衡水: [115.72, 37.72],
  包头: [110, 40.58],
  绵阳: [104.73, 31.48],
  乌鲁木齐: [87.68, 43.77],
  枣庄: [117.57, 34.86],
  杭州: [120.19, 30.26],
  淄博: [118.05, 36.78],
  鞍山: [122.85, 41.12],
  溧阳: [119.48, 31.43],
  库尔勒: [86.06, 41.68],
  安阳: [114.35, 36.1],
  开封: [114.35, 34.79],
  济南: [117, 36.65],
  德阳: [104.37, 31.13],
  温州: [120.65, 28.01],
  九江: [115.97, 29.71],
  邯郸: [114.47, 36.6],
  临安: [119.72, 30.23],
  兰州: [103.73, 36.03],
  沧州: [116.83, 38.33],
  临沂: [118.35, 35.05],
  南充: [106.110698, 30.837793],
  天津: [117.2, 39.13],
  富阳: [119.95, 30.07],
  泰安: [117.13, 36.18],
  诸暨: [120.23, 29.71],
  郑州: [113.65, 34.76],
  哈尔滨: [126.63, 45.75],
  聊城: [115.97, 36.45],
  芜湖: [118.38, 31.33],
  唐山: [118.02, 39.63],
  平顶山: [113.29, 33.75],
  邢台: [114.48, 37.05],
  德州: [116.29, 37.45],
  济宁: [116.59, 35.38],
  荆州: [112.239741, 30.335165],
  宜昌: [111.3, 30.7],
  义乌: [120.06, 29.32],
  丽水: [119.92, 28.45],
  洛阳: [112.44, 34.7],
  秦皇岛: [119.57, 39.95],
  株洲: [113.16, 27.83],
  石家庄: [114.48, 38.03],
  莱芜: [117.67, 36.19],
  常德: [111.69, 29.05],
  保定: [115.48, 38.85],
  湘潭: [112.91, 27.87],
  金华: [119.64, 29.12],
  岳阳: [113.09, 29.37],
  长沙: [113, 28.21],
  衢州: [118.88, 28.97],
  廊坊: [116.7, 39.53],
  菏泽: [115.480656, 35.23375],
  合肥: [117.27, 31.86],
  武汉: [114.31, 30.52],
  大庆: [125.03, 46.58],
  平谷:[117.1,40.13],
    密云:[116.85,40.37],
    顺义:[116.65,40.13],
    通州:[116.66,39.91],
    怀柔:[116.62,40.32],
    大兴:[116.33,39.73],
    房山:[115.98,39.72],
    延庆:[115.97,40.47],
    昌平:[116.2,40.22],
    海淀:[116.31,39.96],
    朝阳:[116.49,39.92],
    石景山:[116.19,39.91],
    西城:[116.37,39.91],
    东城:[116.41,39.92],
    丰台:[116.29,39.86],
    门头沟:[116.11,39.94],
    
    上海:[121.48,31.22],
    上海:[121.48,31.22],
    嘉定:[121.25,31.38],
    宝山:[121.49,31.40],
    奉贤:[121.46,30.92],
    松江:[121.24,31],
    金山:[121.16,30.89],
    青浦:[121.11,31.15],
    崇明:[121.40,31.63],
    浦东新:[121.57,31.25],
    普陀:[121.39,31.24],
    静安:[121.45,31.23],
    虹口:[121.49,31.26],
    杨浦:[121.52,31.27],
    黄浦:[121.49,31.22],
    长宁:[121.42,31.22],
    徐汇:[121.44,31.18],
    闵行:[121.38,31.11],
    
    天津:[117.2,39.13],
    天津:[117.2,39.13],
    宁河:[117.83,39.33],
    蓟州:[117.41,40.05],
    宝坻:[117.31,39.72],
    武清:[117.06,39.37],
    北辰:[117.13,39.23],
    红桥:[117.16,39.18],
    河北:[117.20,39.16],
    南开:[117.16,39.12],
    和平:[117.19,39.12],
    河东:[117.23,39.12],
    河西:[117.22,39.10],
    东丽:[117.31,39.09],
    西青:[117.01,39.14],
    津南:[117.38,38.99],
    滨海新:[117.65,39.03],
    静海:[116.93,38.94],
    
    重庆:[106.54,29.59],
    重庆:[106.54,29.59],
    綦江:[106.56,29.41],
    长寿:[106.64,29.01],
    南桐:[107.04,29.86],
    合川:[106.28,29.26],
    潼南:[106.22,30.03],
    铜梁:[105.8,30.16],
    壁山:[106.03,29.86],
    荣昌:[106.21,29.62],
    大足:[105.59,29.4],
    永川:[105.71,29.75],
    万盛:[105.91,29.38],
    城口县:[108.6649,31.946293],
    巫溪县:[109.628912,31.3966],
    巫山县:[109.878928,31.074843],
    奉节县:[109.465774,31.019967],
    云阳县:[108.697698,30.930529],
    开州:[108.413317,31.167735],
    万州:[108.380246,30.807807],
    梁平:[107.800034,30.672168],
    忠县:[108.037518,30.291537],
    垫江县:[107.348692,30.330012],
    石柱土家族自治县:[108.112448,29.99853],
    黔江:[108.782577,29.527548],
    酉阳土家族苗族自治县:[108.767201,28.839828],
    秀山土家族苗族自治县:[108.996043,28.444772],
    彭水苗族土家族自治县:[108.166551,29.293856],
    武隆:[107.75655,29.32376],
    涪陵:[107.394905,29.703652],
    南川:[107.098153,29.156646],
    大渡口:[106.48613,29.481002],
    北碚:[106.437868,29.82543],
    沙坪坝:[106.4542,29.541224],
    九龙坡:[106.480989,29.523492],
    渝北:[106.512851,29.601451],
    南川:[107.098153,29.156646],
    江津:[106.253156,29.283387],
    江北:[106.532844,29.575352],
    南岸:[106.560813,29.523992],
    巴南:[106.519423,29.381919],
    渝中:[106.56288,29.556742],
    赤峰:[118.956806,42.275317],
    
    西藏自治:[91.11,29.97],
    拉萨:[91.132212,29.660361],
    阿里地:[80.105498,32.503187],
    山南:[91.766529,29.236023],
    昌都:[97.178452,31.136875],
    日喀则:[88.885148,29.267519],
    那曲:[92.060214,31.476004],
    林芝:[94.362348,29.654693],
    
    新疆维吾尔自治:[87.68,43.77],
    乌鲁木齐:[87.617733,43.792818],
    克拉玛依:[84.873946,45.595886],
    吐鲁番:[89.184078,42.947613],
    哈密:[93.51316,42.833248],
    昌吉回族自治州:[87.304012,44.014577],
    博尔塔拉蒙古自治州:[82.074778,44.903258],
    巴音郭楞蒙古自治州:[86.150969,41.768552],
    阿克苏地:[80.265068,41.170712],
    克孜勒苏柯尔克孜自治州:[76.172825,39.713431],
    喀什地:[75.989138,39.467664],
    和田地:[79.92533,37.110687],
    伊犁哈萨克自治州:[81.317946,43.92186],
    塔城地:[82.985732,46.746301],
    阿勒泰地:[88.13963,47.848393],
    石河子:[86.041075,44.305886],
    阿拉尔:[81.285884,40.541914],
    图木舒克:[79.077978,39.867316],
    五家渠:[87.526884,44.167401],
    北屯:[87.824932,47.353177],
    铁门关:[85.501218,41.827251],
    双河:[82.353656,44.840524],
    可克达拉:[80.63579,43.6832],
    昆玉:[79.287372,37.207994],
    胡杨河:[84.8275959,44.69288853],
    
    甘肃省:[103.73,36.03],
    兰州:[103.823557,36.058039],
    临夏回族自治州:[103.212006,35.599446],
    金昌:[102.187888,38.514238],
    张掖:[100.455472,38.932897],
    酒泉:[98.510795,39.744023],
    定西:[104.626294,35.579578],
    甘南藏族自治州:[102.911008,34.986354],
    白银:[104.173606,36.54568],
    陇南:[104.929379,33.388598],
    天水:[105.724998,34.578529],
    庆阳:[107.638372,35.734218],
    嘉峪关:[98.277304,39.786529],
    武威:[102.634697,37.929996],
    平凉:[106.684691,35.54279],
    
    陕西省:[108.95,34.27],
    西安:[108.948024,34.263161],
    汉中:[107.028621,33.077668],
    咸阳:[108.705117,34.333439],
    榆林:[109.741193,38.290162],
    安康:[109.029273,32.6903],
    延安:[109.49081,36.596537],
    宝鸡:[107.14487,34.369315],
    商洛:[109.939776,33.868319],
    渭南:[109.502882,34.499381],
    铜川:[108.979608,34.916582],
    
    四川省:[104.06,30.67],
    成都:[104.065735,30.659462],
    自贡:[104.773447,29.352765],
    攀枝花:[101.716007,26.580446],
    泸州:[105.443348,28.889138],
    德阳:[104.398651,31.127991],
    绵阳:[104.741722,31.46402],
    广元:[105.829757,32.433668],
    遂宁:[105.571331,30.513311],
    内江:[105.066138,29.58708],
    乐山:[103.761263,29.582024],
    南充:[106.082974,30.795281],
    眉山:[103.831788,30.048318],
    宜宾:[104.630825,28.760189],
    广安:[106.633369,30.456398],
    达州:[107.502262,31.209484],
    雅安:[103.001033,29.987722],
    巴中:[106.753669,31.858809],
    资阳:[104.641917,30.122211],
    阿坝藏族羌族自治州:[102.221374,31.899792],
    甘孜藏族自治州:[101.963815,30.050663],
    凉山彝族自治州:[102.258746,27.886762],
    
    广西壮族自治:[108.33,22.84],
    南宁:[108.320004,22.82402],
    柳州:[109.411703,24.314617],
    桂林:[110.299121,25.274215],
    梧州:[111.297604,23.474803],
    北海:[109.119254,21.473343],
    防城港:[108.345478,21.614631],
    钦州:[108.624175,21.967127],
    贵港:[109.602146,23.0936],
    玉林:[110.154393,22.63136],
    百色:[106.616285,23.897742],
    贺州:[111.552056,24.414141],
    河池:[108.062105,24.695899],
    来宾:[109.229772,23.733766],
    崇左:[107.353926,22.404108],
    
    河南省:[113.65,34.76],
    郑州:[113.665412,34.757975],
    开封:[114.341447,34.797049],
    洛阳:[112.434468,34.663041],
    平顶山:[113.307718,33.735241],
    安阳:[114.352482,36.103442],
    鹤壁:[114.295444,35.748236],
    新乡:[113.883991,35.302616],
    焦作:[113.238266,35.23904],
    濮阳:[115.041299,35.768234],
    许昌:[113.826063,34.022956],
    漯河:[114.026405,33.575855],
    三门峡:[111.194099,34.777338],
    南阳:[112.540918,32.999082],
    商丘:[115.650497,34.437054],
    信阳:[114.075031,32.123274],
    周口:[114.649653,33.620357],
    驻马店:[114.024736,32.980169],
    济源:[112.590047,35.090378],
    
    // 内蒙古
    内蒙古自治:[111.65,40.82],
    赤峰: [118.956806, 42.275317],
    呼伦贝尔: [119.758168, 49.215333],
    兴安盟: [122.070317, 46.076268],
    呼和浩特: [111.670801, 40.818311],
    包头: [109.840405, 40.658168],
    乌海: [106.825563, 39.673734],
    通辽: [122.263119, 43.617429],
    鄂尔多斯: [109.99029, 39.817179],
    巴彦淖尔: [107.416959, 40.757402],
    乌兰察布: [113.114543, 41.034126],
    锡林郭勒盟: [116.090996, 43.944018],
    阿拉善盟: [105.706422, 38.844814],
    
    // 吉林省
    吉林省:[125.35,43.88],
    长春: [125.3245, 43.886841],
    吉林: [126.55302, 43.843577],
    四平: [124.370785, 43.170344],
    辽源: [125.145349, 42.902692],
    通化: [125.936501, 41.721177],
    白山: [126.427839, 41.942505],
    松原: [124.823608, 45.118243],
    白城: [122.841114, 45.619026],
    延边朝鲜族自治州: [129.513228, 42.904823],
    
    // 浙江省
    浙江省:[120.19,30.26],
    杭州: [120.153576, 30.287459],
    宁波: [121.549792, 29.868388],
    温州: [120.672111, 28.000575],
    嘉兴: [120.750865, 30.762653],
    湖州: [120.102398, 30.867198],
    绍兴: [120.582112, 29.997117],
    金华: [119.649506, 29.089524],
    衢州: [118.87263, 28.941708],
    舟山: [122.106863, 30.016028],
    台州: [121.428599, 28.661378],
    丽水: [119.921786, 28.451993],
    
    // 江西
    江西省:[115.89,28.68],
    南昌: [115.892151, 28.676493],
    景德镇: [117.214664, 29.29256],
    萍乡: [113.852186, 27.622946],
    九江: [115.992811, 29.712034],
    新余: [114.930835, 27.810834],
    鹰潭: [117.033838, 28.238638],
    赣州: [114.940278, 25.85097],
    吉安: [114.986373, 27.111699],
    宜春: [114.391136, 27.8043],
    抚州: [116.358351, 27.98385],
    上饶: [117.971185, 28.44442],
    
    // 湖北
    湖北省:[114.31,30.52],
    武汉: [114.298572, 30.584355],
    黄石: [115.077048, 30.220074],
    十堰: [110.787916, 32.646907],
    宜昌: [111.290843, 30.702636],
    襄阳: [112.144146, 32.042426],
    鄂州: [114.890593, 30.396536],
    荆门: [112.204251, 31.03542],
    孝感: [113.926655, 30.926423],
    荆州: [112.23813, 30.326857],
    黄冈: [114.879365, 30.447711],
    咸宁: [114.328963, 29.832798],
    随州: [113.37377, 31.717497],
    仙桃: [113.453974, 30.364953],
    潜江: [112.896866, 30.421215],
    天门: [113.165862, 30.653061],
    恩施土家族苗族自治州: [109.4869983114],
    神农架林: [110.671525, 31.74444],
    
    // 广东
    广东省:[113.23,23.16],
    广州: [113.280637, 23.125178],
    韶关: [113.591544, 24.801322],
    深圳: [114.085947, 22.547],
    珠海: [113.553986, 22.224979],
    汕头: [116.708463, 23.37102],
    佛山: [113.122717, 23.028762],
    江门: [113.094942, 22.590431],
    湛江: [110.364977, 21.274898],
    茂名: [110.919229, 21.659751],
    肇庆: [112.472529, 23.051546],
    惠州: [114.412599, 23.079404],
    梅州: [116.117582, 24.299112],
    汕尾: [115.364238, 22.774485],
    河源: [114.697802, 23.746266],
    阳江: [111.975107, 21.859222],
    清远: [113.051227, 23.685022],
    东莞: [113.746262, 23.046237],
    中山: [113.382391, 22.521113],
    潮州: [116.632301, 23.661701],
    揭阳: [116.355733, 23.543778],
    云浮: [112.044439, 22.929801],
    
    // 贵州
    贵州省:[106.71,26.57],
    贵阳: [106.713478, 26.578343],
    遵义: [106.937265, 27.706626],
    六盘水: [104.846743, 26.584643],
    安顺: [105.932188, 26.245544],
    毕节: [105.28501, 27.301693],
    铜仁: [109.191555, 27.718346],
    黔西南布依族苗族自治州: [104.897971, 25.08812],
    黔东南苗族侗族自治州: [107.977488, 26.583352],
    黔南布依族苗族自治州: [107.517156, 26.258219],
    
    // 青海
    青海省:[101.74,36.56],
    西宁: [101.778916, 36.623178],
    海东: [102.10327, 36.502916],
    海北藏族自治州: [100.901059, 36.959435],
    黄南藏族自治州: [102.019988, 35.517744],
    海南藏族自治州: [100.619542, 36.280353],
    果洛藏族自治州: [100.242143, 34.4736],
    玉树藏族自治州: [97.008522, 33.004049],
    海西蒙古族藏族自治州: [97.370785, 37.374663],
    
    // 辽宁
    辽宁省:[123.38,41.8],
    沈阳: [123.429096, 41.796767],
    大连: [121.618622, 38.91459],
    鞍山: [122.995632, 41.110626],
    抚顺: [123.921109, 41.875956],
    本溪: [123.770519, 41.297909],
    丹东: [124.383044, 40.124296],
    锦州: [121.135742, 41.119269],
    营口: [122.235151, 40.667432],
    阜新: [121.648962, 42.011796],
    辽阳: [123.18152, 41.269402],
    盘锦: [122.06957, 41.124484],
    铁岭: [123.844279, 42.290585],
    朝阳: [120.451176, 41.576758],
    葫芦岛: [120.856394, 40.755572],
     
    // 江苏
    江苏省:[118.78,32.04],
    南京: [118.767413, 32.041544],
    无锡: [120.301663, 31.574729],
    徐州: [117.184811, 34.261792],
    常州: [119.946973, 31.772752],
    南通: [120.864608, 32.016212],
    苏州: [120.619585, 31.299379],
    连云港: [119.178821, 34.600018],
    淮安: [119.021265, 33.597506],
    盐城: [120.139998, 33.377631],
    扬州: [119.421003, 32.393159],
    镇江: [119.452753, 32.204402],
    泰州: [119.915176, 32.484882],
    宿迁: [118.275162, 33.963008],
    
    // 安徽
    安徽省:[117.27,31.86],
    合肥: [117.283042, 31.86119],
    芜湖: [118.376451, 31.326319],
    蚌埠: [117.363228, 32.939667],
    淮南: [117.018329, 32.647574],
    马鞍山: [118.507906, 31.689362],
    淮北: [116.794664, 33.971707],
    铜陵: [117.816576, 30.929935],
    安庆: [117.043551, 30.50883],
    黄山: [118.317325, 29.709239],
    滁州: [118.316264, 32.303627],
    阜阳: [115.819729, 32.896969],
    宿州: [116.984084, 33.633891],
    六安: [116.507676, 31.752889],
    亳州: [115.782939, 33.869338],
    池州: [117.489157, 30.656037],
    宣城: [118.757995, 30.945667],
     
    // 河北省
    河北省:[114.48,38.03],
    石家庄:[114.48,38.03],
    唐山:[118.02,39.63],
    秦皇岛:[119.57,39.95],
    邯郸:[114.47,36.6],
    邢台:[114.48,37.05],
    保定:[115.48,38.85],
    张家口:[114.87,40.82],
    承德:[117.93,40.97],
    沧州:[116.83,38.33],
    廊坊:[116.7,39.53],
    衡水:[115.72,37.72],
    
    // 山西省
    山西省:[112.53,37.87],
    太原:[112.53,37.87],
    大同:[113.3,40.12],
    阳泉:[113.57,37.85],
    长治:[113.08,36.18],
    晋城:[112.83,35.52],
    朔州:[112.43,39.33],
    晋中:[112.74,37.7],
    运城:[110.97,35.03],
    忻州:[112.73,38.42],
    临汾:[111.5,36.08],
    吕梁:[111.13,37.52],
    
    // 黑龙江省
    黑龙江省:[126.63,45.75],
    哈尔滨:[126.63,45.75],
    齐齐哈尔:[123.97,47.33],
    鹤岗:[130.3,47.33],
    鸡西:[130.97,45.3],
    双鸭山:[131.17,46.65],
    大庆:[125.03, 46.58],
    伊春:[128.92,47.73],
    佳木斯:[130.35,46.83],
    七台河:[130.83,45.82],
    牡丹江:[129.58,44.6],
    黑河:[127.53,50.22],
    绥化:[127,46.63],
    大兴安岭地:[124.71,52.34],
    
    // 福建省
    福建省:[119.3,26.08],
    福州:[119.3,26.08],
    厦门:[118.1,24.46],
    莆田:[119,25.44],
    三明:[117.61,26.23],
    泉州:[118.58,24.93],
    漳州:[117.35,24.52],
    南平:[118.16,26.65],
    龙岩:[117.01,25.12],
    宁德:[119.52,26.65],
    
    // 山东省
    山东省:[117,36.65],
    济南:[117,36.65],
    青岛:[120.33,36.07],
    淄博:[118.05,36.78],
    枣庄:[117.57,34.86],
    东营:[118.49,37.46],
    烟台:[121.39,37.52],
    潍坊:[119.1,36.62],
    济宁:[116.59,35.38],
    泰安:[117.13,36.18],
    威海:[122.1,37.5],
    日照:[119.46,35.42],
    临沂:[118.35,35.05],
    德州:[116.29,37.45],
    聊城:[115.97,36.45],
    滨州:[118.03,37.36],
    菏泽:[115.47,35.25],
    
    // 湖南省
    湖南省:[113,28.21],
    长沙:[113,28.21],
    株洲:[113.16,27.83],
    湘潭:[112.91,27.87],
    衡阳:[112.61,26.89],
    邵阳:[111.5,27.22],
    岳阳:[113.09,29.37],
    常德:[111.69,29.05],
    张家界:[110.48,29.13],
    益阳:[112.33,28.6],
    郴州:[113,25.79],
    永州:[111.63,26.22],
    怀化:[109.95,27.52],
    娄底:[111.96,27.71],
    湘西土家族苗族自治州:[109.74,28.31],
    
    // 海南省
    海南省:[110.35,20.02],
    海口:[110.35,20.02],
    三亚:[109.51,18.25],
    三沙:[112.35,16.83],
    儋州:[109.58,19.52],
    五指山:[109.52,18.78],
    琼海:[110.46,19.25],
    文昌:[110.72,19.61],
    万宁:[110.39,18.8],
    东方:[108.64,19.09],
    定安县:[110.31,19.68],
    屯昌县:[110.1,19.36],
    澄迈县:[110,19.75],
    临高县:[109.69,19.91],
    白沙黎族自治县:[109.44,19.23],
    昌江黎族自治县:[109.03,19.25],
    乐东黎族自治县:[109.17,18.73],
    陵水黎族自治县:[110.02,18.48],
    保亭黎族苗族自治县:[109.7,18.64],
    琼中黎族苗族自治县:[109.83,19.05],
    
    // 云南省
    云南省:[102.73,25.04],
    昆明:[102.73,25.04],
    曲靖:[103.79,25.51],
    玉溪:[102.52,24.35],
    保山:[99.17,25.11],
    昭通:[103.7,29.32],
    丽江:[100.25,26.86],
    普洱:[101.03,23.07],
    临沧:[100.09,23.89],
    楚雄彝族自治州:[101.54,25.01],
    红河哈尼族彝族自治州:[102.42,23.35],
    文山壮族苗族自治州:[104.24,23.37],
    西双版纳傣族自治州:[100.80,22.00],
    大理白族自治州:[100.19,25.69],
    德宏傣族景颇族自治州:[98.58,24.44],
    怒江傈僳族自治州:[98.85,25.85],
    迪庆藏族自治州:[99.71,27.83],
    
    // 宁夏
    宁夏回族自治:[106.27,38.47],
    银川:[106.27,38.47],
    石嘴山:[106.39,39.04],
    吴忠:[106.21,37.99],
    固原:[106.28,36.01],
    中卫:[105.18,37.51],




};
const convertData = function (data) {
  var res = [];
  for (var i = 0; i < data.length; i++) {
    var geoCoord = geoCoordMap[data[i].name];
    if (geoCoord) {
      res.push({
        name: data[i].name,
        value: geoCoord.concat(data[i].value)
      });
    }
  }
  return res;
};



option = {
  backgroundColor: 'transparent',
  title: {
    text: '中国各省份碳排放量',
    subtext: 'data from stats.gov',
    sublink: 'http://www.stats.gov.cn/',
    left: 'center',
    textStyle: {
      color: '#fff'
    }
  },
  tooltip: {
    trigger: 'item'
  },
  bmap: {
    center: [104.114129, 37.550339],
    zoom: 5,
    roam: true,
    mapStyle: {
      styleJson: [
        {
          featureType: 'water',
          elementType: 'all',
          stylers: {
            color: '#044161'
          }
        },
        {
          featureType: 'land',
          elementType: 'all',
          stylers: {
            color: '#004981'
          }
        },
        {
          featureType: 'boundary',
          elementType: 'geometry',
          stylers: {
            color: '#064f85'
          }
        },
        {
          featureType: 'railway',
          elementType: 'all',
          stylers: {
            visibility: 'off'
          }
        },
        {
          featureType: 'highway',
          elementType: 'geometry',
          stylers: {
            color: '#004981'
          }
        },
        {
          featureType: 'highway',
          elementType: 'geometry.fill',
          stylers: {
            color: '#005b96',
            lightness: 1
          }
        },
        {
          featureType: 'highway',
          elementType: 'labels',
          stylers: {
            visibility: 'off'
          }
        },
        {
          featureType: 'arterial',
          elementType: 'geometry',
          stylers: {
            color: '#004981'
          }
        },
        {
          featureType: 'arterial',
          elementType: 'geometry.fill',
          stylers: {
            color: '#00508b'
          }
        },
        {
          featureType: 'poi',
          elementType: 'all',
          stylers: {
            visibility: 'off'
          }
        },
        {
          featureType: 'green',
          elementType: 'all',
          stylers: {
            color: '#056197',
            visibility: 'off'
          }
        },
        {
          featureType: 'subway',
          elementType: 'all',
          stylers: {
            visibility: 'off'
          }
        },
        {
          featureType: 'manmade',
          elementType: 'all',
          stylers: {
            visibility: 'off'
          }
        },
        {
          featureType: 'local',
          elementType: 'all',
          stylers: {
            visibility: 'off'
          }
        },
        {
          featureType: 'arterial',
          elementType: 'labels',
          stylers: {
            visibility: 'off'
          }
        },
        {
          featureType: 'boundary',
          elementType: 'geometry.fill',
          stylers: {
            color: '#029fd4'
          }
        },
        {
          featureType: 'building',
          elementType: 'all',
          stylers: {
            color: '#1a5787'
          }
        },
        {
          featureType: 'label',
          elementType: 'all',
          stylers: {
            visibility: 'off'
          }
        }
      ]
    }
  },
  series: [
    {
      name: '2019年二氧化碳排放量',
      type: 'scatter',
      coordinateSystem: 'bmap',
      data: convertData(data),
      symbolSize: function (val) {
        return val[2] / 10;
      },
      encode: {
        value: 2
      },
      label: {
        formatter: '{b}',
        position: 'right',
        show: false
      },
      emphasis: {
        label: {
          show: true
        }
      },
	  itemStyle: {
        color: '#ddb926'
      },
    },
    {
      name: 'Top 5',
      type: 'effectScatter',
      coordinateSystem: 'bmap',
      data: convertData(
        data
          .sort(function (a, b) {
            return b.value - a.value;
          })
          .slice(0, 6)
      ),
      symbolSize: function (val) {
        return val[2] / 10;
      },
      encode: {
        value: 2
      },
      showEffectOn: 'render',
      rippleEffect: {
        brushType: 'stroke'
      },
      label: {
        formatter: '{b}',
        position: 'right',
        show: true
      },
      itemStyle: {
		color: '#f4e925',
        shadowBlur: 10,
        shadowColor: '#333'
      },
      emphasis: {
        scale: true
      },
      zlevel: 1
    }
  ]
};

    if (option && typeof option === 'object') {
      myChart.setOption(option);
    }

    window.addEventListener('resize', myChart.resize);
    }



    function echart_4() {
      // 基于准备好的dom，初始化echarts图表
      // 按钮2
      var dom = document.getElementById('chart_4');
  var myChart = echarts.init(dom, null, {
    renderer: 'canvas',
    useDirtyRect: false
  });
  var app = {};
  
  var option;

  option = {
tooltip: {
  trigger: 'item',
  formatter: '{a} <br/>{b} :{d}%'
},
legend: {
  top: '10%',
  left: 'center',
  icon:'circle',
  textStyle:{
    color:'#fff',
    fontSize:15,
  }
},
series: [
  {
    name: '2018年全球温室气体排放来源',
    type: 'pie',
    radius: ['40%', '70%'],
    avoidLabelOverlap: false,
    itemStyle: {
      borderRadius: 15,
      borderColor: '#fff',
      borderWidth: 2
    },
    label: {
      show: false,
      position: 'center',
      //formatter: '{d}%'
    },
    emphasis: {
      label: {
        show: true,
        fontSize: '40',
        fontWeight: 'bold'
      }
    },
    labelLine: {
      show: false
    },
    data: [
      { value: 31.9, name: '电力和热力用能' },
      { value: 16.9, name: '交通用能' },
      { value: 12.6, name: '制造业/建筑业用能' },
      { value: 5.9, name: '燃料逃逸' },
      { value: 5.9, name: '建筑物用能' },
      { value: 3.0, name: '其他燃料'},
      { value: 11.9, name: '燃料逃逸' },
      { value: 5.9, name: '建筑物用能' },
      { value: 3.3, name: '其他燃料'},
      { value: 2.8, name: '土地利用和林业变化'},
    ]
  }
]
};
  if (option && typeof option === 'object') {
    myChart.setOption(option);
  }

  window.addEventListener('resize', myChart.resize);
      }

    function echart_13(){
        //基于准备好的dom，初始化echarts实例
        //按钮4
        var myChart = echarts.init(document.getElementById('chart_13'));
        myChart.clear();
    option = {
  xAxis: {
    type: 'category',
    boundaryGap: false,
    axisLabel:{
      color:'#fff',
    },
    data: ['2020','2022','2024','2026','2028','2030','2032','2034','2036','2038','2040','2042','2044','2046','2048','2050', '2052', '2054', '2056', '2058','2060']
  },
  yAxis: {
    type: 'value',
    axisLabel:{
      color:'#fff',
    }
  },
  series: [
    {
      data: [10.0, 10.6,11.2,11.7,12,11.9,11.8,11.9,11.1,10,9,8.2,7.6,6.5,5.6,4,2.8,2,1,0.5,0],
      type: 'line',
      areaStyle: {}
    }
  ]
};
      myChart.setOption(option);
    }

    function echart_14(){
      //  按钮3
        var dom = document.getElementById('chart_14');
            var myChart = echarts.init(dom, null, {
              renderer: 'canvas',
              useDirtyRect: false
            });
            var app = {};
            
            var option;
        
            option = {
          tooltip: {
            trigger: 'axis',
            axisPointer: {
              type: 'cross',
              crossStyle: {
                color: '#fff'
              }
            }
          },
          toolbox: {
            feature: {
              dataView: { show: true, readOnly: false },
              magicType: { show: true, type: ['line', 'bar'] },
              restore: { show: true },
              saveAsImage: { show: true }
            }
          },
          legend: {
            // data: ['Evaporation', 'Precipitation', 'Temperature']
            data: ['煤炭', '石油', '天然气', '新能源'],
            icon:'circle',
            top:30,
            textStyle:{
              fontSize:18,
              color:'#fff',
            }
          },
          //横坐标
          xAxis: [
            {
              type: 'category',
              data: ['1990','1991','1992','1993','1994','1995','1996','1997','1998','1999','2000','2001','2002','2003','2004','2005','2006','2007','2008','2009','2010','2011','2012','2013','2014','2015','2016','2017','2018','2019','2020'],
              axisPointer: {
                type: 'shadow'
              },
              axisLine:{
                lineStyle:{
                    color:'#ffffff',
                }
            },
            }
          ],
          yAxis: [
            {
              type: 'value',
            //   name: 'Precipitation',
              name: '能源消费量/10+8E(t)',
              min: 0,
              max: 60,
              interval: 10,
              axisLine: {
                lineStyle:{
                    color:'#ffffff',
                }
            },
            },
            {
              type: 'value',
              name: '二氧化碳排放量/10+8E(t)',
              //name: '',
              min: 0,
              max: 120,
              interval: 20,
              axisLabel: {
                
                lineStyle:{
                  fontSize:14,
                  color:'#ffffff',
                } 
              },
            }
          ],
          //数据
          series: [
            {
              name: '煤炭',
              type: 'bar',
              tooltip: {
                valueFormatter: function (value) {
                  return value + ' 10+8E(t)';
                }
              },
              data: [
                7.0, 7.2, 7.4, 7.7, 7.9, 8.1, 8.1, 8.1, 8.1, 8.1, 8.1, 9.4, 10.1, 14, 18.2,18.7,18.9,19.9, 23.4, 25,25.3,25.4,25.3,25.2,25.1,25.3,25.3,25.1, 25
              ]
            },
            {
              name: '石油',
              type: 'bar',
              tooltip: {
                valueFormatter: function (value) {
                  return value + ' 10+8E(t)';
                }
              },
              data: [
                8.8,9.1,9.3,9.6,10,10.1,10.3,10.5,10.7,10.8, 11.0,11.1,12.3,14.7,18.5,22,23.4,25.5,25.6,27.1, 28.7,29.2,29.4,29.6,30.1,30.1,29.8,30.6,30.9,32.7, 33.4
              ]
            },
            {
                name: '天然气',
                type: 'bar',
                tooltip: {
                  valueFormatter: function (value) {
                    return value + ' 10+8E(t)';
                  }
                },
                data: [
                  8.8,9.1,9.3,9.6,10,10.1,10.4,10.6,10.8,10.9, 11.1, 11.2,11.2,14.9,18.6,24.8,23.6,25.7,25.9,27.4,29.1,31.6,31.8,32.1,32.1,30.1,31.9,33.6,34.7,35.1, 36.4
                ]
              },
              {
                name: '新能源',
                type: 'bar',
                tooltip: {
                  valueFormatter: function (value) {
                    return value + ' 10+8E(t)';
                  }
                },
                data: [
                  8.7,9.2,9.5,9.7,10.3,10.6,11.9,12.7,12.6,12.7,13.0,11.3,11.3,17.9,23.1,25,25.6,29.1,29.6,30.9,34.9,35.6,35.8,36.1,36.4,36.5,36.7,36.6,39.8,44.9, 46.7
                ]
              },
              //线型图
            {
              name: '二氧化碳排放量',
              type: 'line',
              yAxisIndex: 1,
              tooltip: {
                valueFormatter: function (value) {
                  return value + ' 10+8E(t)';
                }
              },
              data: [11.7,12.0,12.4,12.9,13,13.3,14.6,15,14.7,14.9, 15.1,15.4,15.3,17.6,23.5,28,29.6,33.4,33.1,34.6, 40.2,42.3,42.6,43.3,43.1,42.9,42.8,42.7,43.9,45.6, 46.7],
            //   axisLine:{
            //     lineStyle:{
            //         color:'#ffffff',
            //     }
            // },
            }
          ]
        };
        
            if (option && typeof option === 'object') {
              myChart.setOption(option);
            }
        
            window.addEventListener('resize', myChart.resize);
    }

    //操作按钮
    $('.t_btn0').click(function () {
        $('.center_text').css('display', 'none');
        $('.t_cos0').css('display', 'block');
        echart_map();
    });
    $('.t_btn1').click(function () {
        $('.center_text').css('display', 'none');
        $('.t_cos1').css('display', 'block');
        echart_2();
    });
    $('.t_btn2').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos2').css('display', 'block');
        echart_0();
    });
    $('.t_btn3').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos3').css('display', 'block');
        echart_4();
    });
    $('.t_btn4').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos6').css('display', 'block');
        echart_6();
    });
    $('.t_btn5').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos4').css('display', 'block');
        echart_1();
    });
    $('.t_btn6').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos5').css('display', 'block');
        echart_3();
    });
    $('.t_btn7').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos7').css('display', 'block');
        echart_7();
    });
    $('.t_btn8').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos8').css('display', 'block');
        echart_8();
    });
    $('.t_btn9').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos9').css('display', 'block');
        echart_9();
    });
    $('.t_btn10').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos10').css('display', 'block');
        echart_10();
    });
    $('.t_btn11').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos11').css('display', 'block');
        echart_11();
    });
    $('.t_btn12').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos12').css('display', 'block');
        echart_12();
    });
    $('.t_btn13').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos13').css('display', 'block');
        echart_13();
    });
    $('.t_btn14').click(function(){
        $('.center_text').css('display', 'none');
        $('.t_cos14').css('display', 'block');
        echart_14();
    });
    //获取地址栏参数
    $(function(){
        function getUrlParms(name){
            var reg = new RegExp("(^|&)"+ name +"=([^&]*)(&|$)");
            var r = window.location.search.substr(1).match(reg);
                if(r!=null)
                return unescape(r[2]);
                return null;
            }
            var id = getUrlParms("id");  
            if(id == 2){
                $('.center_text').css('display', 'none');
                $('.t_cos10').css('display', 'block');
                echart_10();
            }
            if(id == 3){
                $('.center_text').css('display', 'none');
                $('.t_cos11').css('display', 'block');
                echart_11();
            }
            if(id == 4){//中左下
                $('.center_text').css('display', 'none');
                $('.t_cos1').css('display', 'block');
                echart_2();
            }
            if(id == 5){//左下下
                $('.center_text').css('display', 'none');
                $('.t_cos6').css('display', 'block');
                echart_6();
            }
            if(id == 6){
                $('.center_text').css('display', 'none');
                $('.t_cos4').css('display', 'block');
                echart_1();
            }
            if(id == 7){
                $('.center_text').css('display', 'none');
                $('.t_cos8').css('display', 'block');
                echart_8();
            }
            if(id == 8){
                $('.center_text').css('display', 'none');
                $('.t_cos12').css('display', 'block');
                echart_12();
            }
            if(id == 9){//右上
                $('.center_text').css('display', 'none');
                $('.t_cos13').css('display', 'block');
                echart_13();
            }
            //next new
            if(id == 10){//btn2左上
                $('.center_text').css('display', 'none');
                $('.t_cos3').css('display', 'block');
                echart_4();
            }
            if(id == 11){//btn3左下
              $('.center_text').css('display', 'none');
              $('.t_cos14').css('display', 'block');
              echart_14();
            }
            if(id == 12){//右下btn5
              $('.center_text').css('display', 'none');
              $('.t_cos2').css('display', 'block');
              echart_0();
            }
            if(id == 13){//中右下
              $('.center_text').css('display', 'none');
              $('.t_cos5').css('display', 'block');
              echart_0();
            }
            if(id == 14){//右下下
              $('.center_text').css('display', 'none');
              $('.t_cos7').css('display', 'block');
              echart_0();
            }
    });
});
